## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.scan_verdict_unknown`    |
|        | `aws_cloudwatch_metric_alarm.scan_verdict_unknown`         |
| delete | `aws_cloudwatch_log_metric_filter.scan_verdict_suspicious` |
|        | `aws_cloudwatch_metric_alarm.scan_verdict_suspicious`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.scan_verdict_suspicious will be destroyed
  # (because aws_cloudwatch_log_metric_filter.scan_verdict_suspicious is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "scan_verdict_suspicious" {
      - id             = "ScanVerdictSuspicious" -> null
      - log_group_name = "/aws/lambda/scan-files-api" -> null
      - name           = "ScanVerdictSuspicious" -> null
      - pattern        = "?suspicious ?malicious ?unknown ?unable_to_scan" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "ScanVerdictSuspicious" -> null
          - namespace  = "ScanFiles" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_verdict_unknown will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_verdict_unknown" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api"
      + name           = "ScanVerdictUnknown"
      + pattern        = "?unknown ?unable_to_scan"

      + metric_transformation {
          + name      = "ScanVerdictUnknown"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.scan_verdict_suspicious will be destroyed
  # (because aws_cloudwatch_metric_alarm.scan_verdict_suspicious is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "scan_verdict_suspicious" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - alarm_description         = "Scan verdicts that are malicious, suspicious, or that could not complete" -> null
      - alarm_name                = "ScanVerdictSuspicious" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:ScanVerdictSuspicious" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "ScanVerdictSuspicious" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ScanVerdictSuspicious" -> null
      - namespace                 = "ScanFiles" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.scan_verdict_unknown will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_verdict_unknown" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Scans that returned an unknown or unable to scan verdict"
      + alarm_name                            = "ScanVerdictUnknown"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ScanVerdictUnknown"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_health_check_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_scan_object_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_verdict_unknown"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning_us_east"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.s3_scan_object_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scan_files_api_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid:...
```

</details>
